app/Http/Controllers/api/v1/AssessorController.php

select `id`, `code`, `name`, `sort_order` from `iso_standards` where `is_active` = 1 order by `sort_order` asc, `code` asc
---
    public function isoStandards()
    {
        $standards = IsoStandard::query()
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->orderBy('code')
            ->get(['id', 'code', 'name', 'sort_order'])
            ->map(function (IsoStandard $standard) {
                $template = IsoChecklistTemplates::forCode((string) $standard->code);
                $standard->setAttribute('checklist_template', $template);

                return $standard;
            });

update `admins` set `name` = 'Tanmay', `phone` = '94646464545454', `image` = '2026-04-24-69eb5aafeff50.jpg', `password` = '$2y$10$WO2k5IiAnPgSdkkJMErPVe0egGijIPx9EwN8ZSCo2Pnuj5sWgkaS.', `email` = 'thapa1@gmail.com', `admins`.`updated_at` = '2026-04-30 12:30:50' where (`id` = 13)
---
            $userDetails['email'] = $request->email;
        }

        Admin::where(['id' => $assessor->id])->update($userDetails);

select * from `assessors` where (`assessor_id` = 13) limit 1
select * from `assessors` where `assessors`.`assessor_id` in (13)
---
            }
        }

        Assessor::updateOrCreate(['assessor_id' => $assessor->id], $assessorDetails);

        $assessor->refresh();
        $assessor->load('assessor');