app/Http/Controllers/api/v1/AssessorController.php

select * from `assessors` where `assessors`.`assessor_id` in (13)
---
    public function getApplications(Request $request){

        $assessor = $this->assessor;
        $type = $request->type ?? '';
        $status = $request->status ?? '';
        if($status == 'pending') {
            $statusIds = [0,1];
        } else {
            $statusIds = [2];
        }
        $application = Application::with('scheme:id,title,code','auditor:id,name,phone')
            // ->when($type=='document_review', function($q) use($assessor, $statusIds) {
            //     $q->where('auditor_id', $assessor->id)->orWhereRaw('FIND_IN_SET(?, auditor_team_ids)', [$assessor->id])->whereIn('auditor_status', $statusIds);
            // })
            // ->when($type=='office_assessment', function($q) use($assessor, $statusIds) {
            //     $q->where('office_assessment_id', $assessor->id)->orWhereRaw('FIND_IN_SET(?, office_assessment_team_ids)', [$assessor->id])->whereIn('office_assessment_status', $statusIds)->where('auditor_status', 2);
            // })
            // ->when($type=='witness_assessment', function($q)  use($assessor, $statusIds){
            //     $q->where('witness_assessment_id', $assessor->id)->orWhereRaw('FIND_IN_SET(?, witness_assessment_team_ids)', [$assessor->id])->whereIn('witness_assessment_status', $statusIds)->where('office_assessment_status', 2);
            // })
            ->when($type === 'document_review', function ($q) use ($assessor, $statusIds,$type) {
                $q->where(function ($query) use ($assessor) {
                    $query->where('auditor_id', $assessor->id)
                        ->orWhereRaw('FIND_IN_SET(?, auditor_team_ids)', [$assessor->id]);
                })