app/Http/Controllers/api/v1/AssessorController.php

update `admins` set `name` = 'thapa auditor', `phone` = '9300955358', `image` = '2026-04-24-69eb5aafeff50.jpg', `password` = '$2y$10$Ox8WvmpIb6inPWHopT4cp.6wztt103VbE3nIRPfmM0e2o7aRuVjhO', `email` = 'thapa1@gmail.com', `admins`.`updated_at` = '2026-04-30 16:19:21' where (`id` = 13)
select * from `admins` where `id` = 13 limit 1
update `assessors` set `highest_qualification` = 'vusbja', `technical_area` = 'bsbus', `experience` = 0, `home_address` = '123, location', `assessors`.`updated_at` = '2026-04-30 12:30:50' where `id` = 1
---
            $userDetails['email'] = $request->email;
        }

        Admin::where(['id' => $assessor->id])->update($userDetails);

select * from `assessors` where (`assessor_id` = 13) limit 1
---
        }

        if (!empty($data)) {
            $assessorProfile = Assessor::firstOrCreate(['assessor_id' => $admin->id]);

update `assessors` set `qualification_document` = '2026-04-30-69f358e105d7c.jpg', `assessors`.`updated_at` = '2026-04-30 18:58:01' where `id` = 1
---
            }

            if (!empty($updates)) {
                $assessorProfile->update($updates);