app/Http/Controllers/api/v1/auth/PassportAuthController.php

    public function auditorLogin(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'password' => 'required|min:6'
        ]);

        if ($validator->fails()) {
            return response()->json([
                'token' => "",
                'status' => false,
                'message' => "Please fill required fields",
                'data' => [],
                'errors' => Helpers::error_processor($validator)
            ], 403);
        }

        $auditor = Admin::with('assessor')
            ->where('email', $request->email)
            ->where('admin_role_id', 3)
            ->first();
---
select * from `admins` where `email` = 'thapa1@gmail.com' and `admin_role_id` = 3 limit 1
select * from `assessors` where `assessors`.`assessor_id` in (13)