app/Http/Controllers/SuperAdmin/AuditorController.php

select * from `admins` where `admin_role_id` = 3 order by `created_at` desc limit 20 offset 0
select * from `assessors` where `assessors`.`assessor_id` in (13)
select count(*) as aggregate from `admins` where `admin_role_id` = 3
---
    public function index(Request $request)
    {
        $search = trim((string) $request->get('search', ''));
        $hasAssessorsTable = Schema::hasTable('assessors');
        $query = Admin::query()
            ->where('admin_role_id', 3)
            ->when($search !== '', function ($q) use ($search) {
                $q->where(function ($sub) use ($search) {
                    $sub->where('name', 'like', '%'.$search.'%')
                        ->orWhere('email', 'like', '%'.$search.'%')
                        ->orWhere('phone', 'like', '%'.$search.'%');
                });
            })
            ->latest();

        if ($hasAssessorsTable) {
            $query->with('assessor');
        }

        $auditors = $query->paginate(20)->appends(['search' => $search]);

select * from `admins` where `admin_role_id` = 3 and `admins`.`id` = '13' limit 1
select * from `assessors` where `assessor_id` = 13 limit 1
---
    public function edit($id)
    {
        $auditor = Admin::query()
            ->where('admin_role_id', 3)
            ->findOrFail($id);

        $assessor = null;
        if (Schema::hasTable('assessors')) {
            $assessor = Assessor::query()->where('assessor_id', $auditor->id)->first();

select * from `admins` where `admin_role_id` = 3 and `admins`.`id` = '13' limit 1
update `admins` set `status` = 0, `admins`.`updated_at` = '2026-04-30 17:15:22' where `id` = 13
---
    public function status($id, $status)
    {
        $auditor = Admin::query()
            ->where('admin_role_id', 3)
            ->findOrFail($id);

        $auditor->status = (int) $status === 1 ? 1 : 0;
        $auditor->save();

select * from `admins` where `admin_role_id` = 3 and `admins`.`id` = '13' limit 1
---
    private function syncAuditorToTenants(Request $request): void
    {
        $entities = Entity::query()->get();
        foreach ($entities as $entity) {
            try {
                $entity->run(function () use ($request) {
                    if (!DB::getSchemaBuilder()->hasTable('admins')) {
                        return;
                    }
                    if (DB::table('admins')->where('email', $request->email)->exists()) {
                        return;
                    }

                    $adminId = DB::table('admins')->insertGetId([
                        'name' => $request->name,
                        'phone' => $request->phone,
                        'email' => $request->email,
                        'admin_role_id' => 3,
                        'password' => Hash::make($request->password),
                        'status' => 1,
                        'image' => 'def.png',
                        'remember_token' => null,
                        'created_at' => now(),
                        'updated_at' => now(),
                    ]);
