app/Http/Controllers/SuperAdmin/SubdomainManagementController.php

    public function dashboard(string $entityId): View
    {
        $entity = $this->resolveEntity($entityId);
        $pageTitle = 'Super Admin | '.$entity->name.' | '.__('Dashboard');

        $payload = $entity->run(function () {
            $hasApplications = Schema::hasTable('applications');
            $hasOrders = Schema::hasTable('orders');
            $hasUsers = Schema::hasTable('users');
            $hasAdmins = Schema::hasTable('admins');
            $hasProducts = Schema::hasTable('products');
            $hasSellers = Schema::hasTable('sellers');

            $data = [
                'total_application' => $hasApplications ? Application::count() : 0,
                'pending_application' => $hasApplications ? Application::where('is_accept', 0)->count() : 0,
                'complete_application' => $hasApplications ? Application::where('status', 'complete')->count() : 0,
                'rejected_application' => $hasApplications ? Application::where('is_accept', 2)->count() : 0,
                'total_customer' => $hasUsers ? User::count() : 0,
                'total_quality' => $hasAdmins ? Admin::where('admin_role_id', 2)->count() : 0,
                'total_assessor' => $hasAdmins ? Admin::where('admin_role_id', 3)->count() : 0,
                'total_accreditation' => $hasAdmins ? Admin::where('admin_role_id', 5)->count() : 0,
                'total_orders' => $hasOrders ? Order::count() : 0,
                'total_products' => $hasProducts ? Product::count() : 0,
                'total_sellers' => $hasSellers ? Seller::count() : 0,
            ];

            if ($hasApplications && Schema::hasTable('application_payment_details')) {
                $data['total_earning'] = ApplicationPaymentDetail::query()->selectRaw("
                        SUM(CASE WHEN application_fee_status = 1 THEN application_fee ELSE 0 END) +
                        SUM(CASE WHEN document_fee_status = 1 THEN document_fee ELSE 0 END) +
                        SUM(CASE WHEN assessment_fee_status = 1 THEN assessment_fee ELSE 0 END) +
                        SUM(CASE WHEN technical_assessment_fee_status = 1 THEN technical_assessment_fee ELSE 0 END)
                        AS total_earning
                    ")->value('total_earning');
                $data['pending_amount'] = ApplicationPaymentDetail::query()->selectRaw("
                        SUM(CASE WHEN application_fee_status = 0 THEN application_fee ELSE 0 END) +
                        SUM(CASE WHEN document_fee_status = 0 THEN document_fee ELSE 0 END) +
                        SUM(CASE WHEN assessment_fee_status = 0 THEN assessment_fee ELSE 0 END) +
                        SUM(CASE WHEN technical_assessment_fee_status = 0 THEN technical_assessment_fee ELSE 0 END)
                        AS pending_amount
                    ")->value('pending_amount');
---
select count(*) as aggregate from `applications`
select count(*) as aggregate from `applications` where `is_accept` = 0
select count(*) as aggregate from `applications` where `status` = 'complete'
select count(*) as aggregate from `applications` where `is_accept` = 2
select count(*) as aggregate from `users`
select count(*) as aggregate from `admins` where `admin_role_id` = 2
select count(*) as aggregate from `admins` where `admin_role_id` = 3
select count(*) as aggregate from `admins` where `admin_role_id` = 5
select count(*) as aggregate from `orders`
select count(*) as aggregate from `products`
select count(*) as aggregate from `sellers`
select
SUM(CASE WHEN application_fee_status = 1 THEN application_fee ELSE 0 END) +
SUM(CASE WHEN document_fee_status = 1 THEN document_fee ELSE 0 END) +
SUM(CASE WHEN assessment_fee_status = 1 THEN assessment_fee ELSE 0 END) +
SUM(CASE WHEN technical_assessment_fee_status = 1 THEN technical_assessment_fee ELSE 0 END)
AS total_earning
from `application_payment_details` limit 1
select
SUM(CASE WHEN application_fee_status = 0 THEN application_fee ELSE 0 END) +
SUM(CASE WHEN document_fee_status = 0 THEN document_fee ELSE 0 END) +
SUM(CASE WHEN assessment_fee_status = 0 THEN assessment_fee ELSE 0 END) +
SUM(CASE WHEN technical_assessment_fee_status = 0 THEN technical_assessment_fee ELSE 0 END)
AS pending_amount
from `application_payment_details` limit 1

            if (Schema::hasTable('currencies')) {
                try {
                    $currencyId = Helpers::get_business_settings('system_default_currency');
                    $currency = Currency::query()->where('id', $currencyId)->first();
---
select * from `currencies` where `id` = 1 limit 1