app/Http/Controllers/Web/HomeController.php

    public function default_theme()
    {
        $brand_setting = Helpers::get_business_settings('product_brand') ?? '0';
        $home_categories = Category::where('home_status', true)->priority()->get();
        $home_categories->map(function ($data) {
            $id = '"' . $data['id'] . '"';
            $data['products'] = Product::active()
                ->where('category_ids', 'like', "%{$id}%")
                ->inRandomOrder()->take(12)->get();
        });
        //products based on top seller
        $top_sellers = Seller::approved()->with('shop')
            ->withCount(['orders'])->orderBy('orders_count', 'DESC')->take(12)->get();
        //end

        //feature products finding based on selling
        $featured_products = Product::with(['reviews'])->active()
            ->where('featured', 1)
            ->withCount(['order_details'])->orderBy('order_details_count', 'DESC')
            ->take(12)
            ->get();
        //end

        $latest_products = Product::with(['reviews'])->active()->orderBy('id', 'desc')->take(8)->get();
        $categories = Category::with('childes.childes')->where(['position' => 0])->priority()->take(11)->get();
---
select * from `categories` where `home_status` = 1 order by `priority` asc
select * from `categories` where (`position` = 0) order by `priority` asc limit 11