app/CPU/helpers.php

    public static function get_business_settings($name)
    {
        $config = null;
        $check = ['currency_model', 'currency_symbol_position', 'system_default_currency', 'language', 'company_name', 'decimal_point_settings', 'product_brand', 'digital_product', 'company_email', 'recaptcha'];

        if (in_array($name, $check) == true && session()->has($name)) {
            $config = session($name);
        } else {
            $data = BusinessSetting::where(['type' => $name])->first();
---
select * from `business_settings` where (`type` = 'entity_iso_certifications') limit 1

    public static function currency_load()
    {
        $default = Helpers::get_business_settings('system_default_currency');
        $current = \session('system_default_currency_info');
        $currentId = null;
        if ($current instanceof Currency) {
            $currentId = $current->id;
        } elseif (is_array($current) && isset($current['id'])) {
            $currentId = $current['id'];
        }

        if (!session()->has('system_default_currency_info') || (string) $default !== (string) $currentId) {
            $id = Helpers::get_business_settings('system_default_currency');
            $currency = null;
            if ($id && Schema::hasTable('currencies')) {
                $currency = Currency::find($id);
            }
            if (!$currency && Schema::hasTable('currencies')) {
                $currency = Currency::where('status', 1)->orderBy('id')->first();
---
select * from `currencies` where `currencies`.`id` = 1 limit 1
select * from `currencies` where `status` = 1 order by `id` asc limit 1